In [11]:
pip install pandas numpy kagglehub

Defaulting to user installation because normal site-packages is not writeableNote: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.2 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

Requirement already satisfied: pandas in c:\users\hello\appdata\roaming\python\python312\site-packages (2.2.2)
Requirement already satisfied: numpy in c:\users\hello\appdata\roaming\python\python312\site-packages (1.26.4)
Collecting kagglehub
  Downloading kagglehub-0.3.4-py3-none-any.whl.metadata (22 kB)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\hello\appdata\roaming\python\python312\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\hello\appdata\roaming\python\python312\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\hello\appdata\roaming\python\python312\site-packages (from pandas) (2024.1)
Requirement already satisfied: packaging in c:\users\hello\appdata\roaming\python\python312\site-packages (from kagglehub) (24.1)
Requirement already satisfied: requests in c:\users\hello\appdata\roaming\python\python312\site-packages (from kagglehub) (2.32.3)
Requirement already satisfied: tqdm in c:\users\hello\appdata\roaming\python\python312\site-packages (from kagglehub) (4.66.5)
Requirement already satisfied: six>=1.5 in c:\users\hello\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Requirement already satisfied: charset-normalizer<4,>=2 in c:\users\hello\appdata\roaming\python\python312\site-packages (from requests->kagglehub) (3.3.2)
Requirement already satisfied: idna<4,>=2.5 in c:\users\hello\appdata\roaming\python\python312\site-packages (from requests->kagglehub) (3.10)
Requirement already satisfied: urllib3<3,>=1.21.1 in c:\users\hello\appdata\roaming\python\python312\site-packages (from requests->kagglehub) (2.2.3)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\hello\appdata\roaming\python\python312\site-packages (from requests->kagglehub) (2024.8.30)
Requirement already satisfied: colorama in c:\users\hello\appdata\roaming\python\python312\site-packages (from tqdm->kagglehub) (0.4.6)
Downloading kagglehub-0.3.4-py3-none-any.whl (43 kB)
Installing collected packages: kagglehub
Successfully installed kagglehub-0.3.4

In [3]:
import pandas as pd
import numpy as np

## Series

In [7]:
arr = np.array(['item_1', 'item_2', 'item_3', 'item_4', 'item_5'])
print(arr)

arr_series = pd.Series(arr)
print(arr_series)

['item_1' 'item_2' 'item_3' 'item_4' 'item_5']
0    item_1
1    item_2
2    item_3
3    item_4
4    item_5
dtype: object

In [9]:
item_list = ['item_1', 'item_2', 'item_3', 'item_4', 'item_5']

series = pd.Series(item_list)
print(series)

0    item_1
1    item_2
2    item_3
3    item_4
4    item_5
dtype: object

In [18]:
lst = ['item_1', 'item_2', 'item_3', 'item_4']

data = pd.DataFrame(lst)
data

        0
0  item_1
1  item_2
2  item_3
3  item_4

In [19]:
data = {
    'name': ['name_1', 'name_2', 'name_3', 'name_4'],
    'age': [19, 20, 21, 22]
}

data = pd.DataFrame(data)
data

     name  age
0  name_1   19
1  name_2   20
2  name_3   21
3  name_4   22

## Reindexing

In [21]:
res = pd.DataFrame(
    {
        'DAA': [14, 12, 13, 13],
        'WD': [17, 16, 15, 14],
        'A_JAVA': [14, 13, 12, 12]
    }, 
    index = ["Parth", "Patil", "Jay", "JD"]
)

res

       DAA  WD  A_JAVA
Parth   14  17      14
Patil   12  16      13
Jay     13  15      12
JD      13  14      12

In [23]:
data.reindex(["Panchal", "KS", "Kalsariya", "Goswami"])

          name  age
Panchal    NaN  NaN
KS         NaN  NaN
Kalsariya  NaN  NaN
Goswami    NaN  NaN

In [24]:
data.reindex(["Panchal", "KS", "Kalsariya", "Goswami"], fill_value=15)

          name  age
Panchal     15   15
KS          15   15
Kalsariya   15   15
Goswami     15   15

## Pandas Sorting

In [48]:
data = pd.DataFrame(np.random.randn(10, 2), index = [1, 4, 6, 2, 3, 5, 9, 8, 0, 7], columns=['col_2', 'col_1'])
data

      col_2     col_1
1  0.569614 -1.348525
4 -0.589437  0.999419
6  0.916732 -2.681002
2  0.901973  1.019166
3  0.214317 -0.457824
5  0.832609  0.873305
9 -1.127470 -0.099966
8  0.527463 -1.283822
0 -0.694423 -0.687615
7  0.256398 -0.167888

In [ ]:
# By index
info = data.sort_index(ascending=True)
info

      col_2     col_1
0 -0.694423 -0.687615
1  0.569614 -1.348525
2  0.901973  1.019166
3  0.214317 -0.457824
4 -0.589437  0.999419
5  0.832609  0.873305
6  0.916732 -2.681002
7  0.256398 -0.167888
8  0.527463 -1.283822
9 -1.127470 -0.099966

In [53]:
# By columns
info = data.sort_index(axis=True)
info

      col_1     col_2
1 -1.348525  0.569614
4  0.999419 -0.589437
6 -2.681002  0.916732
2  1.019166  0.901973
3 -0.457824  0.214317
5  0.873305  0.832609
9 -0.099966 -1.127470
8 -1.283822  0.527463
0 -0.687615 -0.694423
7 -0.167888  0.256398

In [ ]:
# By Value
info = data.sort_values(by='col_2')
info

      col_2     col_1
9 -1.127470 -0.099966
0 -0.694423 -0.687615
4 -0.589437  0.999419
3  0.214317 -0.457824
7  0.256398 -0.167888
8  0.527463 -1.283822
1  0.569614 -1.348525
5  0.832609  0.873305
2  0.901973  1.019166
6  0.916732 -2.681002

## String Functions

In [58]:
data = pd.Series(['Parth', 'Anamika', 'Shivani'])
print(data.str.lower())

0      parth
1    anamika
2    shivani
dtype: object

In [60]:
print(data.str.upper())
print(data.str.isupper())
print(data.str.islower())
print(data.str.isnumeric())

0      PARTH
1    ANAMIKA
2    SHIVANI
dtype: object
0    False
1    False
2    False
dtype: bool
0    False
1    False
2    False
dtype: bool
0    False
1    False
2    False
dtype: bool

## Statistics Functions

In [64]:
data = pd.DataFrame({
    'A_Java': [18, 17, 14, 14, 15, 12, 13],
    'DAA': [16, 18, 15, 15, 16, 13, 12],
    'WD': [17, 18, 15, 15, 14, 13, 12]
})

data.sum()

A_Java    103
DAA       105
WD        104
dtype: int64

In [65]:
data.count()

A_Java    7
DAA       7
WD        7
dtype: int64

In [66]:
data.max()

A_Java    18
DAA       18
WD        18
dtype: int64

In [67]:
data.min()

A_Java    12
DAA       12
WD        12
dtype: int64

In [68]:
data.median()

A_Java    14.0
DAA       15.0
WD        15.0
dtype: float64

In [ ]:
# Indexing using [] operator
data = pd.read_csv('./Airline.csv', index_col='First Name')
first = data['Age']
print(first)

First Name
Edithe        62
Elwood        62
Darby         67
Dominica      71
Bay           21
              ..
Gareth        85
Kasey         19
Darrin        65
Gayle         34
Wilhelmine    10
Name: Age, Length: 98619, dtype: int64

In [76]:
# Indexing using .loc[]
first = data.loc['Bay']
second = data.loc['Kasey']

print(f'{first} \n\n {second}')

            Passenger ID   Last Name Gender  Age  \
First Name
Bay                82072     Pencost   Male   21
Bay                22564  Hryniewicz   Male   83
Bay                31400     Dumelow   Male   89
Bay                41257     Whiffen   Male   29
Bay                93618      Havill   Male   52
Bay                93588      Rainey   Male   21
Bay                99893       Dinse   Male   23
Bay                78921      Atwood   Male   81
Bay                78472      Crepel   Male    9
Bay                81146        Spur   Male   55

                                 Nationality  \
First Name
Bay                                    China
Bay                                 Colombia
Bay         Democratic Republic of the Congo
Bay                               Kyrgyzstan
Bay                                    China
Bay                                   Sweden
Bay                              Philippines
Bay                                   Brazil
Bay                                    China
Bay                                Indonesia

                                Airport Name Airport Country Code  \
First Name
Bay                          Gillespie Field                   US
Bay            Can Tho International Airport                   VN
Bay             George F. L. Charles Airport                   LC
Bay                      Cape Dorset Airport                   CA
Bay                   Fazenda Cataco Airport                   BR
Bay                            Valle Airport                   US
Bay                            Nowra Airport                   AU
Bay                           Masasi Airport                   TZ
Bay                       Miraflores Airport                   CO
Bay         Concord-Padgett Regional Airport                   US

                            Country Name Airport Continent     Continents  \
First Name
Bay                        United States               NAM  North America
Bay                             Viet Nam                AS           Asia
Bay                          Saint Lucia               NAM  North America
Bay                               Canada               NAM  North America
Bay                               Brazil               SAM  South America
Bay                        United States               NAM  North America
Bay                            Australia                OC        Oceania
Bay         Tanzania, United Republic of                AF         Africa
Bay                             Colombia               SAM  South America
Bay                        United States               NAM  North America

           Departure Date Arrival Airport      Pilot Name Flight Status
First Name
Bay             2/25/2022             SEE     Bay Pencost       On Time
Bay             8/30/2022             VCA  Bay Hryniewicz       On Time
Bay              2/6/2022             SLU     Bay Dumelow       On Time
Bay             9/22/2022             YTE     Bay Whiffen     Cancelled
Bay            11/28/2022               0      Bay Havill     Cancelled
Bay              1/3/2022             VLE      Bay Rainey     Cancelled
Bay             9/28/2022             NOA       Bay Dinse     Cancelled
Bay              5/4/2022             XMI      Bay Atwood       On Time
Bay              4/8/2022             MFS      Bay Crepel       On Time
Bay             9/19/2022             USA        Bay Spur       Delayed

             Passenger ID  Last Name  Gender  Age     Nationality  \
First Name
Kasey              40784     Cloake  Female   24          Russia
Kasey              59042   Pargiter  Female   46  Czech Republic
Kasey              82968  Mattholie  Female   76         Nigeria
Kasey              66063     Godson  Female   50           China
Kasey              86115    Griniov  Female   82           China
Kasey              89280     Retter  Female   28          Sweden
Kasey              44333    Copnell  Female   32           China
Kasey              31938    Froment  Female   89          France
Kasey              74768    Chainey  Female   80           Libya
Kasey              23329    Cheeney  Female   35          Brazil
Kasey              62728     Emsden  Female   18           Yemen
Kasey              16605      McKie  Female    4          Cyprus
Kasey              68433    Macenzy  Female   20       Macedonia
Kasey              22028   Benedict  Female   19          Russia

                                           Airport Name Airport Country Code  \
First Name
Kasey                                   Prieska Airport                   ZA
Kasey                   Pago Pago International Airport                   AS
Kasey                             Salgado Filho Airport                   BR
Kasey                                  Tulaghi Heliport                   SB
Kasey                               Yoshkar-Ola Airport                   RU
Kasey                                     Monto Airport                   AU
Kasey                                    Mwanza Airport                   TZ
Kasey                                     Kudat Airport                   MY
Kasey                                 Ogeranang Airport                   PG
Kasey                                Port Hardy Airport                   CA
Kasey       Eleftherios Venizelos International Airport                   GR
Kasey                       Evansville Regional Airport                   US
Kasey                                      Graz Airport                   AT
Kasey                               Ampampamena Airport                   MG

                            Country Name Airport Continent     Continents  \
First Name
Kasey                       South Africa                AF         Africa
Kasey                     American Samoa                OC        Oceania
Kasey                             Brazil               SAM  South America
Kasey                    Solomon Islands                OC        Oceania
Kasey                 Russian Federation                EU         Europe
Kasey                          Australia                OC        Oceania
Kasey       Tanzania, United Republic of                AF         Africa
Kasey                           Malaysia                AS           Asia
Kasey                   Papua New Guinea                OC        Oceania
Kasey                             Canada               NAM  North America
Kasey                             Greece                EU         Europe
Kasey                      United States               NAM  North America
Kasey                            Austria                EU         Europe
Kasey                         Madagascar                AF         Africa

           Departure Date Arrival Airport       Pilot Name Flight Status
First Name
Kasey           5/25/2022             PRK     Kasey Cloake       On Time
Kasey          12/25/2022             PPG   Kasey Pargiter       On Time
Kasey            3/6/2022             POA  Kasey Mattholie       On Time
Kasey           1/12/2022             TLG     Kasey Godson     Cancelled
Kasey            9/6/2022             JOK    Kasey Griniov     Cancelled
Kasey           2/17/2022             MNQ     Kasey Retter     Cancelled
Kasey          12/26/2022             MWZ    Kasey Copnell     Cancelled
Kasey           5/17/2022             KUD    Kasey Froment     Cancelled
Kasey            9/1/2022             OGE    Kasey Chainey     Cancelled
Kasey           2/19/2022             YZT    Kasey Cheeney       On Time
Kasey           1/19/2022             ATH     Kasey Emsden     Cancelled
Kasey           8/14/2022             EVV      Kasey McKie       Delayed
Kasey           4/13/2022             GRZ    Kasey Macenzy       On Time
Kasey          10/30/2022             IVA   Kasey Benedict     Cancelled

In [77]:
# Indexing using .iloc[]
row = data.iloc[3]
print(f'{row}')

Passenger ID                                78493
Last Name                                    Pyle
Gender                                     Female
Age                                            71
Nationality                                 China
Airport Name            Ottawa / Gatineau Airport
Airport Country Code                           CA
Country Name                               Canada
Airport Continent                             NAM
Continents                          North America
Departure Date                          9/16/2022
Arrival Airport                               YND
Pilot Name                          Dominica Pyle
Flight Status                             Delayed
Name: Dominica, dtype: object